/*=====================================================================
//文件名称：isr.s（中断处理程序源文件）
//框架提供：苏州大学嵌入式系统与物联网研究所（sumcu.suda.edu.cn）
//版本更新：20220128
//功能描述：提供中断处理程序编程框架
//移植规则：【固定】
//====================================================================*/
.include "includes.inc"

/*========================中断函数服务例程============================*/
.section .data
.align 4
/* 设置一个字节变量flag */
flag:
    .byte 0

.section .text

.align 4

/* ===================================================================*/
/* 程序名称：UART_User2_Handler（接收中断处理程序）*/
/* 触发条件：收到一个字节触发*/
/* 程序功能：回发接收到的字节,即收到一个字节回发该字节*/
/* ===================================================================*/
UART_User_Handler:
/*（1）通过调整栈指针给出栈空间用于存放局部变量和保存调用函数的返回地址，
	     中断中栈空间分出32字节，ra为返回地址寄存器，占用4个字节，将ra中
	     的返回地址放入sp指针地址偏移28个字节的位置*/
	ADDI sp,sp,-32                	/* 分配栈空间 */
    SW ra,28(sp)                	/* 存储返回地址 */
/*（2）关总中断：对mstatus（Machine Status）的MIE位（Machine Interrupt Enable）
       即第3位，  */
	LI t0, 0x8						/* t0←0x8 */
	CSRC mstatus, t0				/* 将mstatus寄存器中对应t0中对应为1的位清零*/

/*（3）取出串口发来的一个字节数据 */
	LI a0,UART_User_IRQ 		/* a0←串口号 */
	LA t1,flag			/* 将flag地址赋给t1 */
	LB a1,0(t1)			/* 将t1地址中的数据赋给a1 */
	CALL uart_re1		/* 调用uart_re1 */
	SB a0,0(t1)			/* 将a0中数据写入t1中地址 */

/*（4）发送字节 */
	LI a0,UART_User_IRQ	  /* a0←串口号 */
	LB a1,0(t1)			   /* 将t1地址中的数据赋给a1 */
	CALL uart_send1		   /* 调用uart_send1 */

/*（5）开总中断，恢复现场 */
	LI t0, 0x8			/*t0←0x8*/
	CSRS mstatus, t0	/* 将mstatus寄存器中于t0中相对应为1的位置1*/

/*（6）释放栈空间 */
	LW ra, 28(sp)       /* Restore the return address 恢复返回地址 */
    ADDI sp, sp, 32     /* Deallocating the stack frame 释放栈帧 */
    RET					/* 返回 */


